13/data/attachments/6188af7b5fa3e7a3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_64a9584e-5c47-4125-a098-875c6c0ff435</nif:username>
            <nif:friendToBeAdded>Richard_western_Actions_42197_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>